
 /----------------------------------------------------------------------------\
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |  Copyright (C) 2012 - 2024  Claire Xenia Wolf <claire@yosyshq.com>         |
 |  Distributed under an ISC-like license, type "license" to see terms        |
 \----------------------------------------------------------------------------/
 Yosys 0.46 (git sha1 e97731b9dda91fa5fa53ed87df7c34163ba59a41, clang++ 17.0.6 -fPIC -O3)
Loaded SDC plugin

-- Running command `
                    verilog_defines -D__pnr__;
verilog_defines -DUSE_POWER_PINS;
verilog_defines -DSCL_sky130_fd_sc_hd;
verilog_defines -DPDK_sky130A;
verilog_defines -D__librelane__;
read_verilog -sv -lib /workspace/peripheral-example/openlane/user_project_wrapper/runs/RUN_2025-10-27_23-09-40/tmp/79b7ed8f88ab48719e4d7ebef0da77f6.bb.v;

                    blackbox;
                    write_verilog -noattr -noexpr -nohex -nodec -defparam -blackboxes /workspace/peripheral-example/openlane/user_project_wrapper/runs/RUN_2025-10-27_23-09-40/tmp/79b7ed8f88ab48719e4d7ebef0da77f6.bb.v;
                    ' --

1. Executing Verilog-2005 frontend: /workspace/peripheral-example/openlane/user_project_wrapper/runs/RUN_2025-10-27_23-09-40/tmp/79b7ed8f88ab48719e4d7ebef0da77f6.bb.v
Parsing SystemVerilog input from `/workspace/peripheral-example/openlane/user_project_wrapper/runs/RUN_2025-10-27_23-09-40/tmp/79b7ed8f88ab48719e4d7ebef0da77f6.bb.v' to AST representation.
Generating RTLIL representation for module `\user_project'.
Successfully finished Verilog frontend.

2. Executing Verilog backend.
Dumping module `\user_project'.

End of script. Logfile hash: 5d56a1c86a, CPU: user 2.80s system 0.22s, MEM: 462.55 MB peak
Yosys 0.46 (git sha1 e97731b9dda91fa5fa53ed87df7c34163ba59a41, clang++ 17.0.6 -fPIC -O3)
Time spent: 99% 2x read_verilog (2 sec), 0% 2x write_verilog (0 sec), ...
